app/controllers/slides_controller.rb

  def index
    @slides = Slide.all
---
SELECT "slides".* FROM "slides"

  def show
    @slide = Slide.find(params[:id])
---
SELECT "slides".* FROM "slides" WHERE "slides"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @slide = Slide.new(params[:slide])

    respond_to do |format|
      if @slide.save
---
INSERT INTO "slides" ("content", "created_at", "number", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "?question\r\n!important"], ["created_at", Thu, 09 Feb 2012 05:35:05 UTC +00:00], ["number", 1], ["title", "lolol"], ["updated_at", Thu, 09 Feb 2012 05:35:05 UTC +00:00]]